tutorials/GradP_termalViscosity_incl0/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.lava 0
    volScalarFieldValue T 300
);

regions
(
    boxToCell
    {
        box (70 0 0) (100 10 4);
        fieldValues
        (
            volScalarFieldValue alpha.lava 1
            volScalarFieldValue T 1200
        );
    }
);


// ************************************************************************* //
